{"weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"shape": [3, 3, 3, 32], "name": "conv1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/beta", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 32, 1], "name": "conv_dw_1/depthwise_kernel", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_10/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_11/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_12/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 1024, 1], "name": "conv_dw_13/depthwise_kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/moving_variance", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/beta", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 64, 1], "name": "conv_dw_2/depthwise_kernel", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 128, 1], "name": "conv_dw_3/depthwise_kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 128, 1], "name": "conv_dw_4/depthwise_kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 256, 1], "name": "conv_dw_5/depthwise_kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 256, 1], "name": "conv_dw_6/depthwise_kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_7/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_8/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_9/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 32, 64], "name": "conv_pw_1/kernel", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_10/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_11/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 1024], "name": "conv_pw_12/kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 1024, 1024], "name": "conv_pw_13/kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/moving_variance", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 64, 128], "name": "conv_pw_2/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 128, 128], "name": "conv_pw_3/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 128, 256], "name": "conv_pw_4/kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 256, 256], "name": "conv_pw_5/kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 256, 512], "name": "conv_pw_6/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_7/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_8/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_9/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/moving_variance", "dtype": "float32"}, {"shape": [1024, 256], "name": "fc1_dense/kernel", "dtype": "float32"}, {"shape": [256], "name": "fc1_dense/bias", "dtype": "float32"}, {"shape": [256, 40], "name": "fc2_dense/kernel", "dtype": "float32"}, {"shape": [40], "name": "fc2_dense/bias", "dtype": "float32"}]}], "modelTopology": {"training_config": {"loss_weights": null, "weighted_metrics": null, "optimizer_config": {"config": {"decay": 0.0, "amsgrad": false, "lr": 0.0010000000474974513, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "sample_weight_mode": null, "metrics": ["accuracy"], "loss": "sparse_categorical_crossentropy"}, "backend": "tensorflow", "model_config": {"config": {"output_layers": [["fc2_dense", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 128, 128, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv1_pad", "config": {"trainable": false, "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "name": "conv1_pad", "dtype": "float32"}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [2, 2], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "dtype": "float32", "filters": 32, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv1_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv1_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv1_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv1_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_1", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_1", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_1_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_1_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_1_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_1_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_1", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_1", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 64, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_1_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_1_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_1_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_1_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_2", "config": {"trainable": false, "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "name": "conv_pad_2", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_2", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_2", "bias_constraint": null, "bias_regularizer": null, "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_2_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_2_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_2_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_2_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_2", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_2", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 128, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_2_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_2_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_2_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_2_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_3", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_3", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_3_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_3_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_3_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_3_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_3", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_3", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 128, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_3_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_3_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_3_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_3_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_4", "config": {"trainable": false, "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "name": "conv_pad_4", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_4", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_4", "bias_constraint": null, "bias_regularizer": null, "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_4_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_4_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_4_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_4_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_4", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_4", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 256, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_4_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_4_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_4_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_4_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_5", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_5", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_5_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_5_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_5_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_5_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_5", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_5", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 256, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_5_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_5_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_5_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_5_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "conv_pad_6", "config": {"trainable": false, "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "name": "conv_pad_6", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_6", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_6", "bias_constraint": null, "bias_regularizer": null, "strides": [2, 2], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_6_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_6_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_6_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_6_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_6", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_6", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_6_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_6_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_6_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_6_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_7", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_7", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_7_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_7_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_7_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_7_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_7", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_7", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_7_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_7_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_7_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_7_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_8", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_8", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_8_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_8_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_8_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_8_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_8", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_8", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_8_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_8_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_8_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_8_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_9", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_9", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_9_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_9_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_9_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_9_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_9", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_9", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_9_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_9_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_9_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_9_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_10", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_10", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_10_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_10_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_dw_10_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_dw_10_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_10", "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": false, "name": "conv_pw_10", "bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "filters": 512, "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_10_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_pw_10_bn", "center": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "name": "conv_pw_10_relu", "config": {"threshold": {"type": "ndarray", "value": 0.0}, "trainable": false, "max_value": {"type": "ndarray", "value": 6.0}, "dtype": "float32", "name": "conv_pw_10_relu", "negative_slope": {"type": "ndarray", "value": 0.0}}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_11", "config": {"depthwise_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": false, "depthwise_regularizer": null, "name": "conv_dw_11", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_11_bn", "config": {"beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [3], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": false, "name": "conv_dw_11_bn", "center": true, "momentum": 0.99, 